moifort/stock-alert/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Flash size and mode for XIAO ESP32-S3 Sense
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM (Sense has 8MB embedded)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Main task stack — Matter needs headroom
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Matter / CHIP base
CONFIG_ENABLE_CHIP_SHELL=y
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_USE_MINIMAL_MDNS=n

# Wi-Fi tuning for Matter
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# mbedTLS — Matter needs these
CONFIG_MBEDTLS_HKDF_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y

# NVS encryption disabled for dev — re-enable for production builds
CONFIG_NVS_ENCRYPTION=n
